app/views/movies/_form.html.erb

SELECT "directors".* FROM "directors" ORDER BY "directors"."name" ASC
---
    <p><%= f.label :director_id, 'Diretor(a):' %>
    <%= f.collection_select :director_id, Director.order(:name), :id, :name %></p>

SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
---
    <p><%= f.label :genre_id, 'Gênero:' %>
    <%= f.collection_select :genre_id, Genre.order(:name), :id, :name %></p>