app/controllers/directors_controller.rb

    def show
        @movies = Movie.all
        @director = Director.find(params[:id])
---
SELECT "movies".* FROM "movies"
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @director = Director.new(name: params[:director][:name])

        if @director.save
---
INSERT INTO "directors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "    Lana Wachowski, Lilly Wachowski"], ["created_at", "2023-04-02 17:19:37.152400"], ["updated_at", "2023-04-02 17:19:37.152400"]]

    def edit
        @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]