app/controllers/genres_controller.rb

    def show
        @movies = Movie.all
        @genre = Genre.find(params[:id])
---
SELECT "movies".* FROM "movies"
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @genre = Genre.new(name: params[:genre][:name])

        if @genre.save
---
INSERT INTO "genres" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2023-04-02 16:54:36.438891"], ["updated_at", "2023-04-02 16:54:36.438891"], ["name", "Ação"]]

    def update
        @genre = Genre.find(params[:id])

        if @genre.update(name: params[:genre][:name])
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "genres" SET "updated_at" = ?, "name" = ? WHERE "genres"."id" = ?  [["updated_at", "2023-04-02 17:10:14.896809"], ["name", "Anime"], ["id", 11]]