app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "release_year", "synopsis", "country_of_origin", "time", "created_at", "updated_at", "genre_id", "director_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @movie = Movie.new( title: params[:movie][:title],
                            release_year: params[:movie][:release_year],
                            synopsis: params[:movie][:synopsis],
                            country_of_origin: params[:movie][:country_of_origin],
                            time: params[:movie][:time],
                            director_id: params[:movie][:director_id],
                            genre_id: params[:movie][:genre_id]
        )
        if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Um Sonho de Liberdades"], ["updated_at", "2023-04-02 15:07:05.496362"], ["id", 1]]
---
    def update
        @movie = Movie.find(params[:id])

        if @movie.update(title: params[:movie][:title],
                        release_year: params[:movie][:release_year],
                        synopsis: params[:movie][:synopsis],
                        country_of_origin: params[:movie][:country_of_origin],
                        time: params[:movie][:time],
                        director_id: params[:movie][:director_id],
                        genre_id: params[:movie][:genre_id]
            )

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def publish
        movie = Movie.find(params[:id])